IdeaRS.Connections
GeneralPlateData Properties
Compatible with IDEA StatiCa 0.0
The GeneralPlateData type exposes the following members.
Properties
Name | Description
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
CustomGeometry
 Gets or sets the custom geometrical data
IsActive |  (Inherited from ConnectionCmdData.)
LocIsWelded
LocJointPoint
LocJointRotation
LocLocation
LocMemberPath
LocPitch
LocPlatePath
LocRelatedTo
LocRotation
LocType
LocXposition
LocYposition
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
PlateEdgeInx
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
Shape
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShapeParam1
 Rectangle-B1, Circle-R
ShapeParam2
 Rectangle-B2
ShapeParam3
 Rectangle-H1
ShapeParam4
 Rectangle-H2
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the connected member to plate weld
Top
See Also
Reference
GeneralPlateData Class
IdeaRS.Connections.Data Namespace